; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v5 - type_3 ?v1 - type_2)
 	      (pred_4 ?v4 - object ?v1 - type_2)
	      (pred_3 ?v5 - type_3 ?v6 - type_1)
	      (pred_2 ?v5 - type_3 ?v4 - object ?v6 - type_1))

   (:action op_3
       :parameters  (?v5 - type_3 ?v7 ?v8 - type_2)
       :precondition (and  (pred_1 ?v5 ?v7))
       :effect (and  (pred_1 ?v5 ?v8)
		     (not (pred_1 ?v5 ?v7))))

   (:action op_1
       :parameters (?v5 - type_3 ?v3 - object ?v2 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_4 ?v3 ?v2) (pred_1 ?v5 ?v2) (pred_3 ?v5 ?v6))
       :effect (and (pred_2 ?v5 ?v3 ?v6)
		    (not (pred_4 ?v3 ?v2)) 
		    (not (pred_3 ?v5 ?v6))))

   (:action op_2
       :parameters (?v5 - type_3 ?v3 - object ?v2 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v3 ?v6) (pred_1 ?v5 ?v2))
       :effect (and (pred_4 ?v3 ?v2)
		    (pred_3 ?v5 ?v6)
		    (not (pred_2 ?v5 ?v3 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_3
obj_04 obj_09 - type_1
obj_05 obj_02 obj_01 - type_2
obj_07 obj_03 obj_08 - object)
(:init
(pred_1 obj_06 obj_02)
(pred_3 obj_06 obj_04)
(pred_3 obj_06 obj_09)
(pred_4 obj_07 obj_02)
(pred_4 obj_03 obj_02)
(pred_4 obj_08 obj_02)
)
(:goal
(and
(pred_4 obj_07 obj_01)
(pred_4 obj_03 obj_02)
(pred_4 obj_08 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_06 ?b obj_09))))
)
)

; plan
1. (op_1 obj_06 obj_07 obj_02 obj_04)
   deleted: (pred_4 obj_07 obj_02) (pred_3 obj_06 obj_04)
   added: (pred_2 obj_06 obj_07 obj_04)
   goals met: 1 of 3
2. (op_3 obj_06 obj_02 obj_01)
   deleted: (pred_1 obj_06 obj_02)
   added: (pred_1 obj_06 obj_01)
   goals met: 1 of 3
3. (op_2 obj_06 obj_07 obj_01 obj_04)
   deleted: (pred_2 obj_06 obj_07 obj_04)
   added: (pred_4 obj_07 obj_01) (pred_3 obj_06 obj_04)
   goals met: 2 of 3
4. (op_3 obj_06 obj_01 obj_02)
   deleted: (pred_1 obj_06 obj_01)
   added: (pred_1 obj_06 obj_02)
   goals met: 2 of 3
5. (op_1 obj_06 obj_08 obj_02 obj_04)
   deleted: (pred_4 obj_08 obj_02) (pred_3 obj_06 obj_04)
   added: (pred_2 obj_06 obj_08 obj_04)
   goals met: 2 of 3
6. (op_3 obj_06 obj_02 obj_05)
   deleted: (pred_1 obj_06 obj_02)
   added: (pred_1 obj_06 obj_05)
   goals met: 2 of 3
7. (op_2 obj_06 obj_08 obj_05 obj_04)
   deleted: (pred_2 obj_06 obj_08 obj_04)
   added: (pred_4 obj_08 obj_05) (pred_3 obj_06 obj_04)
   goals met: 3 of 3
